; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	instrument10 - instrument
	satellite4 - satellite
	instrument11 - instrument
	instrument12 - instrument
	instrument13 - instrument
	image2 - mode
	infrared3 - mode
	thermograph0 - mode
	image1 - mode
	spectrograph4 - mode
	Star12 - direction
	Star11 - direction
	Star8 - direction
	GroundStation3 - direction
	Star1 - direction
	GroundStation0 - direction
	Star9 - direction
	Star2 - direction
	Star5 - direction
	Star4 - direction
	GroundStation10 - direction
	GroundStation7 - direction
	GroundStation13 - direction
	GroundStation6 - direction
	Star14 - direction
	Star15 - direction
	Phenomenon16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 infrared3)
	(calibration_target instrument0 Star4)
	(supports instrument1 spectrograph4)
	(supports instrument1 infrared3)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 GroundStation10)
	(calibration_target instrument1 GroundStation13)
	(supports instrument2 image1)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star15)
	(supports instrument3 infrared3)
	(calibration_target instrument3 Star11)
	(supports instrument4 image2)
	(supports instrument4 spectrograph4)
	(calibration_target instrument4 Star8)
	(calibration_target instrument4 Star5)
	(supports instrument5 infrared3)
	(supports instrument5 thermograph0)
	(supports instrument5 image2)
	(calibration_target instrument5 GroundStation10)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon16)
	(supports instrument6 thermograph0)
	(supports instrument6 image1)
	(supports instrument6 infrared3)
	(calibration_target instrument6 GroundStation3)
	(calibration_target instrument6 Star4)
	(calibration_target instrument6 Star9)
	(calibration_target instrument6 GroundStation10)
	(calibration_target instrument6 Star8)
	(supports instrument7 infrared3)
	(supports instrument7 spectrograph4)
	(supports instrument7 image1)
	(calibration_target instrument7 Star8)
	(calibration_target instrument7 GroundStation0)
	(calibration_target instrument7 Star5)
	(calibration_target instrument7 GroundStation13)
	(calibration_target instrument7 Star1)
	(supports instrument8 image2)
	(supports instrument8 infrared3)
	(supports instrument8 spectrograph4)
	(calibration_target instrument8 GroundStation3)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation13)
	(supports instrument9 infrared3)
	(supports instrument9 image1)
	(calibration_target instrument9 Star5)
	(supports instrument10 image2)
	(calibration_target instrument10 GroundStation0)
	(calibration_target instrument10 Star5)
	(calibration_target instrument10 Star1)
	(calibration_target instrument10 GroundStation3)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation3)
	(supports instrument11 image1)
	(calibration_target instrument11 Star9)
	(calibration_target instrument11 Star5)
	(supports instrument12 image2)
	(supports instrument12 spectrograph4)
	(calibration_target instrument12 Star4)
	(calibration_target instrument12 GroundStation6)
	(calibration_target instrument12 Star5)
	(calibration_target instrument12 Star2)
	(supports instrument13 thermograph0)
	(supports instrument13 image1)
	(calibration_target instrument13 Star14)
	(calibration_target instrument13 GroundStation6)
	(calibration_target instrument13 GroundStation13)
	(calibration_target instrument13 GroundStation7)
	(calibration_target instrument13 GroundStation10)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(on_board instrument13 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation10)
)
(:goal (and
	(pointing satellite2 GroundStation0)
	(have_image Star15 image1)
	(have_image Phenomenon16 image2)
	(have_image Planet17 spectrograph4)
))

)

; plan
1. (switch_on instrument7 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument7)
   goals met: 0 of 4
2. (calibrate satellite2 instrument7 groundstation13)
   added: (calibrated instrument7)
   goals met: 0 of 4
3. (turn_to satellite2 star15 groundstation13)
   deleted: (pointing satellite2 groundstation13)
   added: (pointing satellite2 star15)
   goals met: 0 of 4
4. (take_image satellite2 star15 instrument7 image1)
   added: (have_image star15 image1)
   goals met: 1 of 4
5. (turn_to satellite2 planet17 star15)
   deleted: (pointing satellite2 star15)
   added: (pointing satellite2 planet17)
   goals met: 1 of 4
6. (switch_on instrument10 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument10)
   goals met: 1 of 4
7. (calibrate satellite3 instrument10 groundstation3)
   added: (calibrated instrument10)
   goals met: 1 of 4
8. (take_image satellite2 planet17 instrument7 spectrograph4)
   added: (have_image planet17 spectrograph4)
   goals met: 2 of 4
9. (turn_to satellite2 groundstation0 planet17)
   deleted: (pointing satellite2 planet17)
   added: (pointing satellite2 groundstation0)
   goals met: 3 of 4
10. (turn_to satellite3 phenomenon16 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 phenomenon16)
   goals met: 3 of 4
11. (take_image satellite3 phenomenon16 instrument10 image2)
   added: (have_image phenomenon16 image2)
   goals met: 4 of 4
